tutorials/combustion/XiDyMFoam/annularCombustorTurbine/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.mesh

rm -rf 0 && cp -r 0.org 0

runApplication decomposePar -force

n=$(echo processor* | wc -w)

runParallel potentialFoam $n -pName pPotential -initialiseUBCs

rm -f processor*/0/phi

runParallel XiDyMFoam $n
